GET_STARTED/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9                                   	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

z 0.1;
alpha 0.5;
beta 0.5;

vertices        
(
   ( 0.0 0.0 0.0) // V0
   ( $alpha 0.0 0.0) // V1
   ( $beta 1.0 0.0) // V2
   ( 0.0 1.0 0.0) // V3
   ( 0.0 0.0 $z) // V4
   ( $alpha 0 $z) // V5
   ( $beta 1.0 $z) // V6
   ( 0.0 1.0 $z) // V7
   ( 1.0 0.0 0.0) // V8
   ( 1.0 1.0 0.0) // V9
   ( 1.0 1.0 $z) // V10
   ( 1.0 0.0 $z) // V11
);

blocks          
(
    hex (0 1 2 3 4 5 6 7)   (25 25 1) simpleGrading (1 1 1)
    hex (1 8 9 2 5 11 10 6)   (25 25 1) simpleGrading (1 1 1)
);

edges           
(
    spline 1 2
    (
        (0.2 0.2 0.0)  // Control point 1
        (0.4 0.4 0.0)  // Control point 2
        (0.6 0.7 0.0)  // Control point 3
        (0.8 0.9 0.0)  // Control point 4
    )
    spline 5 6
    (
        (0.2 0.2 $z)   // Control point 1 for z plane
        (0.4 0.4 $z)   // Control point 2 for z plane
        (0.6 0.7 $z)   // Control point 3 for z plane
        (0.8 0.9 $z)   // Control point 4 for z plane
    )
);

patches         
(
    patch left 
    (
        (0 4 7 3)
    )
    patch right 
    (
        (8 9 10 11)
    )
    empty back
    (
        (0 1 2 3)
        (1 8 9 2)
    )
    empty front
    (
        (4 5 6 7)
        (5 11 10 6)
    )
    patch bottom
    (
        (0 1 5 4)
        (1 8 11 5)
    )
    patch top
    (
        (2 3 7 6)
        (2 6 10 9)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //

