GET_STARTED/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    bottom_1
    {
        type            zeroGradient;
    }
    bottom_2
    {
        type            zeroGradient;
    }
    back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
    
		left
    {
        type            zeroGradient;
    }
    right
    {
        type            fixedValue;
        value           uniform 0;
    }
    top_1
    {
        type            zeroGradient;
    }
    top_2
    {
        type            zeroGradient;
    }
//    slipsurface
//    {
//        type            slip;
//    }
}


// ************************************************************************* //
