GET_STARTED/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

//internalField   uniform 0.00015; //1%
internalField   uniform 0.00375; //5%
//internalField   uniform 0.015; //10%

boundaryField
{
    bottom_1
    {
        type            slip;
    }
    bottom_2
    {
        type            fixedValue;
        value           uniform 1e-10;

//        type            kLowReWallFunction;
//        value           uniform 0.00015;
    }
    back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
    left
    {
        type            fixedValue;
        //value           uniform 0.00015;
        value           uniform 0.00375;
        //value           uniform 0.015;
    }
    right
    {
        type            zeroGradient;
    }
    top_1
    {
        type            zeroGradient;
    }
    top_2
    {
        type            zeroGradient;
    }
    slipsurface
    {
        type            slip;
    }
}


// ************************************************************************* //
