GET_STARTED/0/nuTilda
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 2e-05;

boundaryField
{
    bottom_1
    {
        type            fixedValue;
        //type            nutUSpaldingWallFunction;
        value           uniform 0;
    }
    bottom_2
    {
        type            fixedValue;
        value           uniform 0.00;
        //type            nutUSpaldingWallFunction;
        //value           uniform 0;
    }
    back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
    left
    {
        type            fixedValue;
        value           uniform 0;
    }
    right
    {
        type            fixedValue;
        value           uniform 0;
    }
    top_1
    {
        type            fixedValue;
        value           uniform 0;
    }
    top_2
    {
        type            fixedValue;
        value           uniform 0;
    }
    slipsurface
    {
        type            slip;
    }
}


// ************************************************************************* //
