GET_STARTED/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 0.1;

boundaryField
{
    bottom_1
    {
        type            slip;
//        type            fixedValue;
//        value           uniform 0;
//        type            omegaWallFunction;
//        value           uniform 4000000;
    }
    bottom_2
    {
        type            fixedValue;
        value           uniform 1e-10;
//        type            omegaWallFunction;
//        value           uniform 4000000;
    }
    back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
    left
    {
        type            fixedValue;
        value           uniform 0.1;
    }
    right
    {
        type            zeroGradient;
    }
    top_1
    {
        type            zeroGradient;
    }
    top_2
    {
        type            zeroGradient;
    }
    slipsurface
    {
        type            slip;
    }
}


// ************************************************************************* //
